package com.jmzd.ghazal.movies
/* توضیحات کلی پروژه */
/*
* در مورد پکیج بندی ها:
* repository:
* توس این ریپازیتوری ما میایم اطلاعاتی که قراره رد و بدل بشه را کنترل میکنیم
* چه برای سرور چه برای دیتابیس
* خوبیش اینه که هم زمان جفتش را با هم داریم
* مثلا در صفحه detail هم سرور را داریم هم دیتابیس را داریم جفتشون تو یه ریپازیتوری ترکیب میشن
* */

/*
* نکته: فرگمنت که میسازید همه چیو پاک کنید به جز onCreateView
* */

/*
* ساختار اکتیویتی قرار هست سینگل اکتیویتی باشه و کل اپ روی یک اکتیویتی سوار میشه
* مثلا بعضی فرگمنت ها مثل اسپلش اصلا باتم نویگیشن ندارن
* یاد میگیریم اینا را هندل کنیم
*
*
* */

/*
* شروع با
* -> Splash Fragment
* */